{
  "entries": [
    {
      "id": 1,
      "date": "01/03/2019",
      "concepts": "basic CSS and HTML",
      "entry": "went over vanilla HTML and CSS; remember to review relationship selectors for CSS (this has progressed beyond what you used to know [oooo exciting!]); mvp means Minimum Viable Product",
      "mood": "anxious"
    },
    {
      "id": 2,
      "date": "01/04/2019",
      "concepts": "git and Github",
      "entry": "git is both more complicated and less complicated than I thought; dvcs means Distributed Versioning Control System; practise the git workflow",
      "mood": "happy"
    },
    {
      "id": 3,
      "date": "01/07/2019",
      "concepts": "more gitting",
      "entry": "practised git workflow and worked out tiny rough edges all day",
      "mood": "happy"
    },
    {
      "id": 4,
      "date": "01/09/2019",
      "concepts": "group sprint",
      "entry": "I can't keep spending all my time helping someone else with things they should have made notes about; at least steve says there's normally time waiting when you're done and other people aren't; note to self: on the next project, we need to do better at both assigning people to specific tasks, and not stepping over each other on those tasks. Only one person should write the actual css code. git becomes very complicated when more than one person is working on exactly the same piece of code.",
      "mood": "furious"
    },
    {
      "id": 5,
      "date": "01/10/2019",
      "concepts": "group project",
      "entry": "I should not have lied about how the group project made me feel",
      "mood": "frustrated"
    },
    {
      "id": 6,
      "date": "01/11/2019",
      "concepts": "Objects and notations",
      "entry": "today we learned about objects, dot notation, and bracket notation; practise writing and reading arrow functions; Arrays are for collections of things; objects describe single things; Define a thing in an object, then group object in arrays",
      "mood": "happy"
    },
    {
      "id": 7,
      "date": "01/21/2019",
      "concepts": "apis get, fetch",
      "entry": "fetch is a kind of Promise. Promise in JS means exactly what it sounds like: 'I promise I'll get you this data'. Seems to work in an if...when kind of way. It's possible to nest these, probably many layers deep, but scope is an issue. use the data from the fetch as near to the fetch as possible. public apis are thoroughly complicated",
      "mood": "happy"
    },
    {
      "date": "2019-01-31",
      "concepts": "JSON POST method",
      "entry": "trying to add the POST method to my journal. practising factory functions, had check-in meeting.",
      "mood": "happy",
      "id": 8
    }
  ],
  "extras": [
    {},
    {}
  ]
}